# ML Titanic Age Regressor
This notebook develop regression model for age prediction to fill na values in original dataset

In [21]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [22]:
titanic_data = pd.read_csv("../../data/train.csv")
titanic_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [23]:
print("Missing values:")
titanic_data.isna().sum()

Missing values:

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

# Data preprocessing

Some of the passangers have a long name because of their high social status.

In [ ]:
#count number of words by spaces in names
name_words_count = titanic_data.Name.apply(lambda x: x.count(" "))
titanic_data["Name"] = name_words_count

#drop tickets number from dataset
titanic_data.drop("Ticket", axis=1)

titanic_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked
0,1,0,3,3,male,22.0,1,0,7.2500,NaN,S
1,2,1,1,6,female,38.0,1,0,71.2833,C85,C
2,3,1,3,2,female,26.0,0,0,7.9250,NaN,S
3,4,1,1,6,female,35.0,1,0,53.1000,C123,S
4,5,0,3,3,male,35.0,0,0,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,2,male,27.0,0,0,13.0000,NaN,S
887,888,1,1,3,female,19.0,0,0,30.0000,B42,S
888,889,0,3,4,female,NaN,1,2,23.4500,NaN,S
889,890,1,1,3,male,26.0,0,0,30.0000,C148,C
890,891,0,3,2,male,32.0,0,0,7.7500,NaN,Q